In [11]:
#ETL Extract Trandorm Load

In [13]:
import pandas as pd

In [15]:
data={
    'ID':[1,2,3,4,5,6],
    'Name':['Ram','Shyam','Raju','Kaju','Prem','Rahul'],
    'Age':[20,32,23,40,21,30],
    'State':["MH","GJ","UP","MP","MH","UP"],
    'Sales':[200,300,450,320,420,250]
}

In [19]:
df=pd.DataFrame(data)
print("Original data :")
df

Original data :

   ID   Name  Age State  Sales
0   1    Ram   20    MH    200
1   2  Shyam   32    GJ    300
2   3   Raju   23    UP    450
3   4   Kaju   40    MP    320
4   5   Prem   21    MH    420
5   6  Rahul   30    UP    250

# Transform data

In [23]:
df['Name_Upper']=df['Name'].str.upper()
print("\nCharacter Map (Uppercase Names) : ")
print(df[['ID','Name','Name_Upper']])

Character Map (Uppercase Names) :
   ID   Name Name_Upper
0   1    Ram        RAM
1   2  Shyam      SHYAM
2   3   Raju       RAJU
3   4   Kaju       KAJU
4   5   Prem       PREM
5   6  Rahul      RAHUL

In [33]:
# multicasting (copying the dataset )

In [41]:
df_copy1=df.copy()
df_copy2=df.copy()

df_copy1['Sales']*=1.1
df_copy2['Age']+=5

print("\nMulticast (Modified Copies) : ")
print("Copy 1 (Sales Increased) :")
print(df_copy1)
print("\nCopy 2 (Age Increased) : ")
print(df_copy2)

Multicast (Modified Copies) :
Copy 1 (Sales Increased) :
   ID   Name  Age State  Sales Name_Upper
0   1    Ram   20    MH  220.0        RAM
1   2  Shyam   32    GJ  330.0      SHYAM
2   3   Raju   23    UP  495.0       RAJU
3   4   Kaju   40    MP  352.0       KAJU
4   5   Prem   21    MH  462.0       PREM
5   6  Rahul   30    UP  275.0      RAHUL

Copy 2 (Age Increased) :
   ID   Name  Age State  Sales Name_Upper
0   1    Ram   25    MH    200        RAM
1   2  Shyam   37    GJ    300      SHYAM
2   3   Raju   28    UP    450       RAJU
3   4   Kaju   45    MP    320       KAJU
4   5   Prem   26    MH    420       PREM
5   6  Rahul   35    UP    250      RAHUL

In [43]:
#conditionally split the data

In [45]:
high_sales=df[df['Sales']>300]
low_sales=df[df['Sales']<=300]
print("\nConditional Split : ")
print("High Sales : ")
print(high_sales)
print("\nLow Sales: ")
print(low_sales)

Conditional Split :
High Sales :
   ID  Name  Age State  Sales Name_Upper
2   3  Raju   23    UP    450       RAJU
3   4  Kaju   40    MP    320       KAJU
4   5  Prem   21    MH    420       PREM

Low Sales:
   ID   Name  Age State  Sales Name_Upper
0   1    Ram   20    MH    200        RAM
1   2  Shyam   32    GJ    300      SHYAM
5   6  Rahul   30    UP    250      RAHUL

In [53]:
#Aggregation aggregate data , e.g , calculate total sales by country.  
agg_df=df.groupby('State')['Sales'].sum().reset_index()
print("\nAggregation (Total Sales by Country):")
print(agg_df)

Aggregation (Total Sales by Country):
  State  Sales
0    GJ    300
1    MH    620
2    MP    320
3    UP    700

In [57]:
# sorting sales in descending order 
sorted_df=df.sort_values(by='Sales',ascending=False)
print("\nSort (Descending Sales):")
print(sorted_df)

Sort (Descending Sales):
   ID   Name  Age State  Sales Name_Upper
2   3   Raju   23    UP    450       RAJU
4   5   Prem   21    MH    420       PREM
3   4   Kaju   40    MP    320       KAJU
1   2  Shyam   32    GJ    300      SHYAM
5   6  Rahul   30    UP    250      RAHUL
0   1    Ram   20    MH    200        RAM

In [59]:
#derieved column

In [63]:
df['Sales_Category']=df['Sales'].apply(lambda x : 'High' if x > 300 else 'Low')
print("\nDerieved Column (Sales Category): ")
print(df[['ID','Name','Sales','Sales_Category']])

Derieved Column (Sales Category):
   ID   Name  Sales Sales_Category
0   1    Ram    200            Low
1   2  Shyam    300            Low
2   3   Raju    450           High
3   4   Kaju    320           High
4   5   Prem    420           High
5   6  Rahul    250            Low